Revit 2027 API
BuiltInFailures.CurtainWallFailures.GridlinesWerePushed Property
 Panels and mullions created by a curtain grid were created with slight inaccuracies.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridlinesWerePushed { get; }
Public Shared ReadOnly Property GridlinesWerePushed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridlinesWerePushed {
	FailureDefinitionId^ get ();
}
static member GridlinesWerePushed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace